experiment-finetuned/all_finetuned/runs/squareBend/1/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    // Block 0 - inlet straight section
    (-50 25 25)     // 0
    (-50 25 -25)    // 1
    (-50 -25 -25)   // 2
    (-50 -25 25)    // 3
    (25 25 25)      // 4
    (25 25 -25)     // 5
    (25 -25 -25)    // 6
    (25 -25 25)     // 7

    // Block 1 - bend section
    (25 0 25)       // 8
    (25 0 -25)      // 9
    (25 -50 -25)    // 10
    (25 -50 25)     // 11
    (-25 -50 25)    // 12
    (-25 -50 -25)   // 13
    (-25 0 -25)     // 14
    (-25 0 25)      // 15

    // Block 2 - outlet straight section
    (-25 -25 25)    // 16
    (-25 -25 -25)   // 17
    (-25 -75 -25)   // 18
    (-25 -75 25)    // 19
    (-500 -125 25)  // 20
    (-500 -125 -25) // 21
    (-500 -175 -25) // 22
    (-500 -175 25)  // 23
);

blocks
(
    hex (0 4 7 3 1 5 6 2) (20 20 1) simpleGrading (1 1 1)
    hex (4 8 11 7 5 9 10 6) (20 20 1) simpleGrading (1 1 1)
    hex (8 15 16 11 9 14 17 10) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (0 4 5 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (20 21 22 23)
        );
    }
    walls
    {
        type wall;
        faces
        (
            // Block 0 outer faces
            (0 1 2 3)
            (4 7 6 5)
            
            // Block 1 outer faces
            (4 5 9 8)
            (7 11 10 6)
            (8 15 16 11)
            (9 14 17 10)
            
            // Block 2 outer faces
            (15 12 19 16)
            (14 17 18 13)
            (16 19 23 20)
            (17 18 22 21)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            // z = 25 faces
            (0 3 7 4)
            (4 7 11 8)
            (8 11 12 15)
            (16 15 19 12)
            (20 16 19 15)
            
            // z = -25 faces
            (1 5 6 2)
            (5 9 10 6)
            (9 14 17 10)
            (14 17 18 13)
            (13 18 22 21)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //